---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.WallNominalThickness
source: html/9502e8b6-b41f-04fd-b478-ef11966bc0dc.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed.WallNominalThickness Property

Represents wall nominal thickness of rectangle.

## Syntax (C#)
```csharp
public double WallNominalThickness { get; set; }
```

## Remarks
Nominal is measured real value of profile, should be thicker than designed.